bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F745.svd
            <register>
               <name>OTG_HS_GNPTXSTS</name>
               <displayName>OTG_HS_GNPTXSTS</displayName>
               <description>OTG_HS nonperiodic transmit FIFO/queue           status register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00080200</resetValue>
               <fields>
                  <field>
                     <name>NPTXFSAV</name>
                     <description>Nonperiodic TxFIFO space               available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>NPTQXSAV</name>
                     <description>Nonperiodic transmit request queue space               available</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NPTXQTOP</name>
                     <description>Top of the nonperiodic transmit request               queue</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_GCCFG</name>
               <displayName>OTG_HS_GCCFG</displayName>
               <description>OTG_HS general core configuration           register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PWRDWN</name>
                     <description>Power down</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BCDEN</name>
                     <description>Battery charging detector (BCD)               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCDEN</name>
                     <description>Data contact detection (DCD) mode               enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDEN</name>
                     <description>Primary detection (PD) mode               enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDEN</name>
                     <description>Secondary detection (SD) mode               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBDEN</name>
                     <description>USB VBUS detection enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCDET</name>
                     <description>Data contact detection (DCD)               status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDET</name>
                     <description>Primary detection (PD)               status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDET</name>
                     <description>Secondary detection (SD)               status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2DET</name>
                     <description>DM pull-up detection               status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_CID</name>
               <displayName>OTG_HS_CID</displayName>
               <description>OTG_HS core ID register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x00001200</resetValue>
               <fields>
                  <field>
                     <name>PRODUCT_ID</name>
                     <description>Product ID field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HPTXFSIZ</name>
               <displayName>OTG_HS_HPTXFSIZ</displayName>
               <description>OTG_HS Host periodic transmit FIFO size           register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x02000600</resetValue>
               <fields>
                  <field>
                     <name>PTXSA</name>
                     <description>Host periodic TxFIFO start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PTXFD</name>
                     <description>Host periodic TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTXF1</name>
               <displayName>OTG_HS_DIEPTXF1</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO size           register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTXF2</name>
               <displayName>OTG_HS_DIEPTXF2</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO size           register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTXF3</name>
               <displayName>OTG_HS_DIEPTXF3</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO size           register</description>
               <addressOffset>0x11C</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTXF4</name>
               <displayName>OTG_HS_DIEPTXF4</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO size           register</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTXF5</name>
               <displayName>OTG_HS_DIEPTXF5</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO size           register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTXF6</name>
               <displayName>OTG_HS_DIEPTXF6</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO size           register</description>
               <addressOffset>0x128</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTXF7</name>
               <displayName>OTG_HS_DIEPTXF7</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO size           register</description>
               <addressOffset>0x12C</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_GRXSTSR_Device</name>
               <displayName>OTG_HS_GRXSTSR_Device</displayName>
               <description>OTG_HS Receive status debug read register           (peripheral mode mode)</description>
               <alternateRegister>OTG_HS_GRXSTSR_Host</alternateRegister>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BCNT</name>
                     <description>Byte count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTSTS</name>
                     <description>Packet status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FRMNUM</name>
                     <description>Frame number</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_GRXSTSP_Device</name>
               <displayName>OTG_HS_GRXSTSP_Device</displayName>
               <description>OTG_HS status read and pop register           (peripheral mode)</description>
               <alternateRegister>OTG_HS_GRXSTSP_Host</alternateRegister>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BCNT</name>
                     <description>Byte count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTSTS</name>
                     <description>Packet status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FRMNUM</name>
                     <description>Frame number</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_GLPMCFG</name>
               <displayName>OTG_HS_GLPMCFG</displayName>
               <description>OTG core LPM configuration           register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>LPMEN</name>
                     <description>LPM support enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMACK</name>
                     <description>LPM token acknowledge               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BESL</name>
                     <description>Best effort service               latency</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>REMWAKE</name>
                     <description>bRemoteWake value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>L1SSEN</name>
                     <description>L1 Shallow Sleep enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BESLTHRS</name>
                     <description>BESL threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>L1DSEN</name>
                     <description>L1 deep sleep enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMRST</name>
                     <description>LPM response</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SLPSTS</name>
                     <description>Port sleep status</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>L1RSMOK</name>
                     <description>Sleep State Resume OK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LPMCHIDX</name>
                     <description>LPM Channel Index</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMRCNT</name>
                     <description>LPM retry count</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNDLPM</name>
                     <description>Send LPM transaction</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMRCNTSTS</name>
                     <description>LPM retry count status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ENBESL</name>
                     <description>Enable best effort service               latency</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
