bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F745.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>STK</name>
         <description>SysTick timer</description>
         <groupName>STK</groupName>
         <baseAddress>0xE000E010</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x11</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>SysTick control and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Counter enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TICKINT</name>
                     <description>SysTick exception request               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKSOURCE</name>
                     <description>Clock source selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COUNTFLAG</name>
                     <description>COUNTFLAG</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RVR</name>
               <displayName>RVR</displayName>
               <description>SysTick reload value register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>RELOAD value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVR</name>
               <displayName>CVR</displayName>
               <description>SysTick current value register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>CURRENT</name>
                     <description>Current counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALIB</name>
               <displayName>CALIB</displayName>
               <description>SysTick calibration value           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>TENMS</name>
                     <description>Calibration value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>SKEW</name>
                     <description>SKEW flag: Indicates whether the TENMS               value is exact</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOREF</name>
                     <description>NOREF flag. Reads as zero</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>NVIC_STIR</name>
         <description>Nested vectored interrupt       controller</description>
         <groupName>NVIC</groupName>
         <baseAddress>0xE000EF00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x5</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>STIR</name>
               <displayName>STIR</displayName>
               <description>Software trigger interrupt           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>Software generated interrupt               ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>FPU_CPACR</name>
         <description>Floating point unit CPACR</description>
         <groupName>FPU</groupName>
         <baseAddress>0xE000ED88</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x5</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CPACR</name>
               <displayName>CPACR</displayName>
               <description>Coprocessor access control           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000000</resetValue>
               <fields>
                  <field>
                     <name>CP</name>
                     <description>CP</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
